{
    "navbar": {
        "start": "Start",
        "aboutMe": "About me",
        "worksAndExperiences": "Works and Experiences",
        "contact": "Contact",
        "curriculum": "Resume (Português)"
    },
    "console": {
        "texto": "I have a degree in Systems Analysis and Development from Fatene since 2017 and specialized in Fullstack programming from Labenu. Since 2021, I have been building REST APIs in the Backend with a focus on Node.JS, TypeScript, Express.JS, Nest.JS and PostgreSQL. I also build interfaces using React.JS on Frontend. In addition to technical skills, I have excellent team collaboration and clear communication skills. Throughout my academic training and practical experience, I developed robust skills in web development, actively participated in projects that improved the user experience, prioritizing cleaner and more efficient interfaces. I am enthusiastic about driving challenging projects.",
        "console3": "About me:"
    },
    "content": {
        "ola": "Hi, I am Othon",
        "titulo": "Fullstack Developer [Backend && Frontend]",
        "skills": "My Skills"
    },
    "contato": {
        "redes": "Social media:"
    },
    "projetos": {
        "tituloCard1": "Mercado Pago Fee Calculator",
        "descCard1": "An application that accurately calculates the amount that must be charged on the Mercado Pago machine, if the customer wants to pay in installments for a purchase on credit.",
        "botao": "Check",
        "tituloCard2": "Dynamic Chart Generator",
        "descCard2": "An application that receives a .XLSX spreadsheet file from the user and, using the data in the file, generates dynamic graphs of monthly metrics.",
        "tituloCard3": "Backend application for publishing and consulting job vacancies.",
         "descCard3": "A Backend application for a job vacancy website. It was a challenging project that made me learn more about AWS Cloud and integrated use of A.I.",
         "tituloCard4": "Commercial website with quote generating application.",
         "descCard4": "A website for a family member's business with a section that receives user data and generates a PDF of a dynamic quote. Only an authenticated user can generate the quote.",
         "tituloCard5": "Professional Inventory Organization System.",
         "descCard5": "An inventory management system for a friend's company. With PostgreSQL database, NodeJS and ReactJS on the Frontend. It's under construction right now."
    },
    "trabalhos": {
        "titulo": "Education and Experience",
        "detalheCard1": "I studied Systems Analysis and Development at the Faculty of Technology of the Northeast (Fatene).",
        "detalheCard2": "Fullstack Programming Certification.",
        "detalheCard3": "I worked at Hapvida Notre Dame. I was responsible for the implementation, maintenance and continuous improvement of custom systems and applications. I offer specialized technical support, meeting users' needs and collaborate closely with the development team to create effective solutions.",
        "detalheCard4": "I worked at Ame Digital, a company in the Americanas group (B2W). I collaborate closely with the development team to optimize API functionalities, ensuring a seamless experience for users.",
        "card5Titulo": "2023 - Moment",
        "detalheCard5": "I work as a Freelance Fullstack Web Programmer building APIs with NodeJS and Frontend in ReactJS.",
        "titulo2": "Projects carried out:",
        "botão": "Back"

    },
    "hardskills": {
        "javascript": "I Use with TypeScript and Node JS to create powerful Backend tools..",
        "TypeScript": "It helps me a lot to create Web applications (especially in the Backend), I love this superset.",
        "git": "Use for everything that is most essential for a Programmer (code versioning, etc.)",
        "react": "The Frontend building tool that I master and prefer to use. This page was made with ReactJS.",
        "mysql": "The world's most popular open source database",
        "PostgreSQL": "The database I use most and prefer for personal projects",
        "nodejs": "It's my 'strong point' at the moment, the main technology I use in web applications.",
        "express": "It was the first web application framework with which I did something really meaningful.",
        "heroku": "I've already created applications on both the Backend and Frontend to run on Heroku, too bad it's now paid 😢.",
        "docker": "I have solid knowledge in programming in Microservices, creating and maintaining applications in Containers",
        "aws": "I continue to learn about AWS, I will soon have the 'AWS Developer Associate' Certification",
        "gcp": "I got hands-on experience in my last role.",
        "nest": "More practical to build than ExpressJS. I'm loving NestJS too!"
    }
}