{
    "navbar": {
        "start": "Start",
        "aboutMe": "About me",
        "worksAndExperiences": "Works and Experiences",
        "contact": "Contact",
        "curriculum": "Resume (Português)"
    },
    "console": {
        "texto": "Graduated in Systems Analysis and Development from Fatene (2017), with a specialization in Fullstack programming from Labenu. Since 2021, I have been developing REST APIs in the Backend, focusing on Node.js, TypeScript, Express.js, Nest.js and PostgreSQL. In the Frontend, I create interfaces with React.js. In addition to my technical skills, I highlight my ability to collaborate in a team and communicate clearly. My education and experience have given me robust skills in web development, and I have participated in projects that improved the user experience, prioritizing clean and efficient interfaces. I am motivated by challenges and enthusiastic about driving new projects forward.",
        "console3": "About me:"
    },
    "content": {
        "ola": "Hi, I am Othon",
        "titulo": "Fullstack Developer [Backend && Frontend]",
        "skills": "My Skills",
        "certificacoes": "Certifications"
    },
    "contato": {
        "redes": "Social media:"
    },
    "projetos": {
        "tituloCard1": "Mercado Pago Fee Calculator",
        "descCard1": "An application that accurately calculates the amount that must be charged on the Mercado Pago machine, if the customer wants to pay in installments for a purchase on credit.",
        "botao": "Check",
        "tituloCard2": "Dynamic Chart Generator",
        "descCard2": "An application that receives a .XLSX spreadsheet file from the user and, using the data in the file, generates dynamic graphs of monthly metrics.",
        "tituloCard3": "Backend application for publishing and consulting job vacancies.",
        "descCard3": "A Backend application for a job vacancy website. It was a challenging project that made me learn more about AWS Cloud and integrated use of A.I.",
        "tituloCard4": "Commercial website with quote generating application.",
        "descCard4": "A website for a family member's business with a section that receives user data and generates a PDF of a dynamic quote. Only an authenticated user can generate the quote.",
        "tituloCard5": "Professional Inventory Organization System.",
        "descCard5": "An inventory management system for a friend's company. With PostgreSQL database, NodeJS and ReactJS on the Frontend. It's under construction right now."
    },
    "trabalhos": {
        "titulo": "Education and Experience",
        "detalheCard1": "I completed the Systems Analysis and Development course at Faculdade de Tecnologia do Nordeste (Fatene), where I acquired fundamental knowledge in several areas of programming, including Object-Oriented Programming (OOP), Relational Databases, Project Management, UML Modeling, Mobile Application Development and Programming Logic. During my studies, I participated in collaborative projects to complete the course, which provided me with significant growth in facing complex technical challenges.",
        "detalheCard2": "I obtained my Fullstack Programming certification, deepening my knowledge in technologies such as Node.js and React.js. During the course, I focused on creating endpoints with Express.js and developing clean and intuitive interfaces using React. In addition, I faced several technical challenges that contributed significantly to my growth as a Fullstack Programmer..",
        "detalheCard3": "I worked at Hapvida Notre Dame. I was responsible for the implementation, maintenance and continuous improvement of custom systems and applications. I offer specialized technical support, meeting users' needs and collaborate closely with the development team to create effective solutions.",
        "detalheCard4": "I worked at Ame Digital, a company in the Americanas group (B2W). My day-to-day was more focused on testing the company's Backend application, together with the development team to optimize the APIs' functionalities, ensuring a continuous experience for users.",
        "card5Titulo": "2023 - Moment",
        "detalheCard5": "I work as a Freelance Fullstack Web Developer building APIs with NodeJS and Frontend in ReactJS. I use Express and NestJS to create the endpoints that will be consumed in the Frontend. I work with microservices in Docker and usually do my Deployments in AWS, Vercel or Heroku. I also use NextJS, and I like to style my Frontend using Styled-Components.",
        "titulo2": "Projects carried out:",
        "botão": "Back"
    },
    "hardskills": {
        "javascript": "With three years of experience in JavaScript development, I have a proven track record of successfully delivering projects. My past projects include inventory management systems, among others, which have resulted in more organization and efficient strategic data collection for the client. I am a dedicated collaborator and always strive to stay up to date with the latest trends in the field.",
        "TypeScript": "I have strong experience in creating clean, scalable and highly type-safe code. I am proficient in static typing, interfaces, generics and object-oriented programming. I am passionate about building robust and reliable applications using TypeScript.",
        "git": "Solid experience in Git and GitHub for version management and collaboration on software projects. Proficiency in workflows such as Git Flow and GitHub Flow, including branch creation, merges, pull requests and conflict resolution. Ability to use tools such as GitHub Actions to automate tasks and integrate with CI/CD.",
        "react": "React developer with solid experience in building complex and performant user interfaces using functional and class components. Proficient in JSX and React hooks to create reusable and efficient components. Experience in optimizing the performance of React applications through techniques such as memoization and lazy loading.",
        "mysql": "I have strong knowledge of MySQL, with experience in creating and optimizing stored procedures and triggers. Ability to automate tasks and implement complex business rules using PL/SQL. Experience working with different types of data, including textual, numeric and date/time.",
        "PostgreSQL": "Solid experience in PostgreSQL, with strong skills in writing complex SQL queries, including joins, subqueries, aggregations and window functions. Experience in optimizing query performance through indexing, view creation and execution plan analysis. Familiarity with the latest versions of PostgreSQL and its advanced features.",
        "nodejs": "Node.js developer with solid experience in building scalable and robust RESTful APIs. Proficiency in frameworks such as Express.js and Nest.js to create efficient back-end applications. Experience working with relational databases, using ORMs such as Sequelize and Query Builders such as knex.js.",
        "express": "Node.js developer with solid experience in building scalable and robust RESTful APIs using Express.js. Expertise in routing, middleware and error handling to create efficient back-end applications.",
        "heroku": "Solid experience in deploying and managing applications on Heroku. Ability to configure development, staging, and production environments. Experience in scaling applications to meet peak demand, using resources such as dynos and workers. Knowledge of using Heroku addons and monitoring tools to optimize application performance.",
        "docker": "Solid experience in application containerization using Docker. Ability to create efficient Dockerfiles and optimize images to reduce size and increase performance. Experience with container orchestration using tools such as Docker Compose and Kubernetes to manage complex and scalable environments.",
        "aws": "Solid experience in architecting and implementing solutions on AWS. Expertise in services such as EC2, S3, RDS, Lambda and ECS to build scalable and resilient applications. Experience in designing reference architectures and cost optimization.",
        "gcp": "Proficient in GCP, with experience in automating deployment and infrastructure processes using tools such as Cloud Deployment Manager, Terraform and Cloud Build. Ability to configure CI/CD pipelines to ensure continuous delivery of applications. Experience working with monitoring and logging tools such as Cloud Monitoring and Cloud Logging.",
        "nest": "Experience in building scalable and robust RESTful APIs using NestJS. Mastery of modules, controllers, services and providers to create modular and well-organized applications. Experience working with relational and NoSQL databases, using ORMs such as Sequelize and Mongoose.",
        "next": "I am a professional specialized in Next.js, with extensive experience in building modern and high-performance web applications. I have deep knowledge in SSR (Server-Side Rendering), SSG (Static Site Generation) and SEO optimization, ensuring efficient and scalable solutions.",
        "jest": "Strong experience in automated testing using Jest.js. Ability to write unit and integration tests to ensure code quality in JavaScript and TypeScript projects. Mastery of mocks, stubs and spies to isolate code units and simulate dependencies. Experience in setting up test environments and generating code coverage reports."
    }
}