{
    "navbar": {
        "start": "Start",
        "aboutMe": "About me",
        "worksAndExperiences": "Works and Experiences",
        "contact": "Contact",
        "curriculum": "Curriculum"
    },
    "console": {
        "texto": "Graduated in Systems Analysis and Development from Fatene since 2017 and specialized in Fullstack programming from Labenu. Since 2021, I have been building REST APIs on the Backend with a focus on Node.JS, TypeScript, Express.JS, Knex.JS and PostgreSQL, as well as using React.JS on the Frontend. In my last contract I also had experience with tools such as: Datadog, Kibana Elastic and Google Cloud Platform. My professional ambition is to advance my career as a Backend and Frontend Developer.",
        "console3": "About me:"
    },
    "content": {
        "ola": "Hi, I am Othon",
        "titulo": "Fullstack Developer [Backend && Frontend]",
        "skills": "My Skills"
    },
    "contato": {
        "redes": "Social media:"
    },
    "projetos": {
        "tituloCard1": "Mercado Pago Fee Calculator",
        "descCard1": "An application that accurately calculates the amount that must be charged on the Mercado Pago machine, if the customer wants to pay in installments for a purchase on credit.",
        "botao": "Check"
    },
    "trabalhos": {
        "titulo": "Education and Experience",
        "detalheCard1": "I studied Systems Analysis and Development at the Faculty of Technology of the Northeast (Fatene)",
        "detalheCard2": "Fullstack Programming Certification",
        "detalheCard3": "I worked at Hapvida Notre Dame.",
        "detalheCard4": "I worked at Ame Digital, a company in the Americanas group (B2W).",
        "card5Titulo": "2023 - Moment",
        "detalheCard5": "I work as a Freelance Fullstack Web Programmer.",
        "titulo2": "Projects carried out:",
        "botão": "Back"

    },
    "hardskills": {
        "javascript": "I use TypeScript and NodeJS to create valuable things for people.",
        "TypeScript": "It helps me a lot to create Web applications (especially in the Backend), I love this superset.",
        "git": "Use for everything that is most essential for a Programmer (code versioning, etc.)",
        "react": "The Frontend building tool that I master and prefer to use. This page was made with ReactJS.",
        "mysql": "The world's most popular open source database",
        "PostgreSQL": "The database I use most and prefer for personal projects",
        "nodejs": "It's my 'strong point' at the moment, the main technology I use in web applications.",
        "express": "It was the first web application framework with which I did something really meaningful.",
        "heroku": "I've already created applications on both the Backend and Frontend to run on Heroku, too bad it's now paid 😢.",
        "docker": "I have solid knowledge in programming in Microservices, creating and maintaining applications in Containers",
        "aws": "I continue to learn about AWS, I will soon have the 'AWS Developer Associate' Certification",
        "gcp": "I got hands-on experience in my last role.",
        "nest": "More practical to build than ExpressJS. I'm loving NestJS too!"
    }
}