{
    "navbar": {
        "start": "Iniciar",
        "aboutMe": "Sobre mim",
        "worksAndExperiences": "Trabalhos e Experiências",
        "contact": "Contato",
        "curriculum": "Currículo (Português)"
    },
    "console": {
        "texto": "Sou graduado em Análise e Desenvolvimento de Sistemas pela Fatene desde 2017 e especializado em programação Fullstack pela Labenu. Desde 2021 construo APIs REST no Backend com foco em Node.JS, TypeScript, Express.JS, Nest.JS e PostgreSQL. Também construo interfaces utilizando React.JS no Frontend. Além das habilidades técnicas, possuo excelente capacidade de colaboração em equipe e comunicação clara. Ao longo de minha formação acadêmica e experiência prática, desenvolvi habilidades robustas em desenvolvimento web, participei ativamente de projetos que aprimoraram a experiência do usuário, priorizando interfaces mais limpas e eficientes. Sou entusiasmado para impulsionar projetos desafiadores.",
        "console3": "Sobre mim:"
    },
    "content": {
        "ola": "Olá, eu sou o Othon",
        "titulo": "Desenvolvedor Fullstack [Backend && Frontend]",
        "skills": "Minhas Skills"
    },
    "contato": {
        "redes": "Redes Sociais:"
    },
    "projetos": {
        "tituloCard1": "Calculadora de Taxas Mercado Pago",
        "descCard1": "Uma aplicação que calcula com precisão o valor que deve ser cobrado na maquininha do Mercado Pago, caso o cliente queira parcelar uma compra no crédito.",
        "botao": "Conferir",
        "tituloCard2": "Gerador de Gráficos Dinâmicos",
        "descCard2": "Uma aplicação que recebe por upload do usuário um arquivo de planilhas .XLSX e apartir dos dados do arquivo gera gráficos dinâmicos de métricas mensais."
    },
    "trabalhos": {
        "titulo": "Educação e Experiência",
        "detalheCard1": "Cursei Análise e Desenvolvimento de Sistemas na Faculdade de Tecnologia do Nordeste (Fatene)",
        "detalheCard2": "Certificação em Programação Fullstack, me aprofundei em Tecnologias como Node.js e React.js.",
        "detalheCard3": "Trabalhei na Hapvida Notre Dame. Fui responsável pela implementação, manutenção e aprimoramento contínuo de sistemas e aplicativos personalizados. Ofereço suporte técnico especializado, atendendo às necessidades dos usuários e colaboro estreitamente com a equipe de desenvolvimento na criação desoluções eficazes.",
        "detalheCard4": "Atuei na Ame Digital, uma empresa do grupo Americanas (B2W). Colaboro estreitamente com a equipe dedesenvolvimento para otimizar as funcionalidades das APIs, garantindo uma experiência contínua aos usuários.",
        "card5Titulo": "2023 - Momento",
        "detalheCard5": "Atuo como Programador Web Fullstack Freelancer construindo APIs com NodeJS e Frontend em ReactJS.",
        "titulo2": "Projetos Realizados:",
        "botão": "Voltar"

    },
    "hardskills": {
        "javascript": "Uso aliado ao TypeScript e ao NodeJS para criar poderosas ferramentas de Backend.",
        "TypeScript": "Me ajuda e muito a criar aplicações Web (principalmente no Backend), amo este superset.",
        "git": "Uso para tudo o que é mais essencial para um Programador (versionamento de códigos, etc).",
        "react": "A ferramenta de construção de Frontend que domino e que prefiro usar. Esta página foi feita usando ReactJS.",
        "mysql": "O banco de dados de código aberto mais popular do mundo.",
        "PostgreSQL": "O banco de dados que mais uso e prefiro para projetos pessoais.",
        "nodejs": "É o meu 'ponto forte' no momento, a tecnologia principal que uso em aplicações Web.",
        "express": "Foi a primeira estrutura de aplicação web com a qual eu fiz algo realmente relevante.",
        "heroku": "Já criei aplicações tanto no Backend quanto no Frontend para rodarem no Heroku, pena que agora ele é pago 😢.",
        "docker": "Tenho conhecimento sólido em programação em Microsserviços, criação e manutenção de aplicações em Containers",
        "aws": "Sigo aprendendo sobre AWS, em breve terei a Certificação 'AWS Developer Associate'",
        "gcp": "Tive experiência prática em minha última função.",
        "nest": "Mais prático de se criar do que o ExpressJS. Estou amando o NestJS também!"
    }
}