{
    "navbar": {
        "start": "Comenzar",
        "aboutMe": "Sobre mi",
        "worksAndExperiences": "Trabajos y experiencias",
        "contact": "Contacto",
        "curriculum": "Historial profesional (Português)"
    },
    "console": {
        "texto": "Licenciado en Análisis y Desarrollo de Sistemas por Fatene desde 2017 y especializado en programación Fullstack por Labenu. Desde 2021, he estado creando API REST en el Backend con enfoque en Node.JS, TypeScript, Express.JS, Knex.JS y PostgreSQL, además de usar React.JS en el Frontend. En mi último contrato también tuve experiencia con herramientas como: Datadog, Kibana Elastic y Google Cloud Platform. Mi ambición profesional es avanzar en mi carrera como Desarrollador Backend y Frontend.",
        "console3": "Sobre mi:"
    },
    "content": {
        "ola": "Hola, soy Othon",
        "titulo": "Desarrollador Fullstack [Backend && Frontend]",
        "skills": "Mis habilidades"
    },
    "contato": {
        "redes": "Redes Sociales:"
    },
    "projetos": {
        "tituloCard1": "Calculadora de Tarifas de Mercado Pago",
        "descCard1": "Una aplicación que calcula con precisión el monto que se debe cargar en la máquina de Mercado Pago, si el cliente quiere pagar en cuotas una compra a crédito.",
        "botao": "Controlar",
        "tituloCard2": "Generador de gráficos dinámicos",
        "descCard2": "Una aplicación que recibe un archivo de hoja de cálculo .XLSX del usuario y, utilizando los datos del archivo, genera gráficos dinámicos de métricas mensuales."
    },
    "trabalhos": {
        "titulo": "Educación y experiencia",
        "detalheCard1": "Estudié Análisis y Desarrollo de Sistemas en la Facultad de Tecnología del Nordeste (Fatene)",
        "detalheCard2": "Certificación de programación Fullstack",
        "detalheCard3": "Trabajé en Hapvida Notre Dame.",
        "detalheCard4": "Trabajé en Ame Digital, empresa del grupo Americanas (B2W).",
        "card5Titulo": "2023 - momento presente",
        "detalheCard5": "Trabajo como programador web freelance fullstack.",
        "titulo2": "Proyectos realizados:",
        "botão": "Volver"

    },
    "hardskills": {
        "javascript": "Utilizo TypeScript y NodeJS para crear cosas valiosas para las personas.",
        "TypeScript": "Me ayuda mucho a crear aplicaciones Web (especialmente en el Backend), me encanta este superconjunto.",
        "git": "Úselo para todo lo que es más esencial para un programador (versiones de código, etc.)",
        "react": "La herramienta de creación de Frontend que domino y prefiero usar. Esta página fue creada con ReactJS.",
        "mysql": "La base de datos de código abierto más popular del mundo",
        "PostgreSQL": "La base de datos que más uso y prefiero para proyectos personales",
        "nodejs": "Es mi 'punto fuerte' en este momento, la principal tecnología que uso en aplicaciones web.",
        "express": "Fue el primer marco de aplicación web con el que hice algo realmente significativo.",
        "heroku": "Ya he creado aplicaciones tanto en el Backend como en el Frontend para ejecutarlas en Heroku, lástima que ahora sea pago 😢.",
        "docker": "Tengo sólidos conocimientos en programación en Microservicios, creación y mantenimiento de aplicaciones en Contenedores",
        "aws": "Sigo aprendiendo sobre AWS, pronto tendré la Certificación 'AWS Developer Associate'",
        "gcp": "Obtuve experiencia práctica en mi último puesto.",
        "nest": "Más práctico de construir que ExpressJS. ¡A mí también me encanta NestJS!"
    }
}